In [129]:
people = {
  "first": ['Corey', 'Jane', 'John'],
  "last": ['Schafer', 'Doe', 'Doe'],
  "email": ['corey@g.com', 'jane@g.com', 'john@g.com'],
}

import pandas as pd

df = pd.DataFrame(people)

df

   first     last        email
0  Corey  Schafer  corey@g.com
1   Jane      Doe   jane@g.com
2   John      Doe   john@g.com

add new column full_name with first and last column data

In [130]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [131]:
df['full_name'] = df['first'] + ' ' + df['last'] # Note: we have to use bracket notation to assign the new column coz if we use dot notation then python will think that we are trying to assign an attribute instead
df

   first     last        email      full_name
0  Corey  Schafer  corey@g.com  Corey Schafer
1   Jane      Doe   jane@g.com       Jane Doe
2   John      Doe   john@g.com       John Doe

In [132]:
# to remove column use drop
df.drop(columns='first')

      last        email      full_name
0  Schafer  corey@g.com  Corey Schafer
1      Doe   jane@g.com       Jane Doe
2      Doe   john@g.com       John Doe

In [133]:
# to remove multiple columns pass column names in list
df.drop(columns=['first', 'last'])

         email      full_name
0  corey@g.com  Corey Schafer
1   jane@g.com       Jane Doe
2   john@g.com       John Doe

In [134]:
df

   first     last        email      full_name
0  Corey  Schafer  corey@g.com  Corey Schafer
1   Jane      Doe   jane@g.com       Jane Doe
2   John      Doe   john@g.com       John Doe

In [135]:
# to persist the drop changes pass inplace=True
df.drop(columns=['first', 'last'], inplace=True)
df

         email      full_name
0  corey@g.com  Corey Schafer
1   jane@g.com       Jane Doe
2   john@g.com       John Doe

In [136]:
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [137]:
# get the split data in seperate column
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [138]:
# add these to new columns
df[['first_name', 'last_name']] = df['full_name'].str.split(' ', expand=True)
df

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe

adding row

In [139]:
df.append({'first_name': 'Aayush'}) # append is deprecated use _append or concat

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
# df._append({'first_name': 'Aayush'}) # we have to pass ignore_index=True to append
df._append({'first_name': 'Aayush'}, ignore_index=True)

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
3          NaN            NaN     Aayush       NaN

In [ ]:
df2 = pd.DataFrame([{'first_name': 'Aayush'}])
df = pd.concat([df, df2])

In [ ]:
df

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
0          NaN            NaN     Aayush       NaN

In [ ]:
# notice how the index is now 0 for new data at last.
# if you want the index to continuously increase then use ignore_index=True
df2 = pd.DataFrame([{'first_name': 'Aayush'}])
df = pd.concat([df, df2], ignore_index=True)

In [ ]:
df # the column that we didn't insert value will get NaN as default value

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
3          NaN            NaN     Aayush       NaN
4          NaN            NaN     Aayush       NaN

add one dataframe to another

In [ ]:
people2 = {
  "first_name": ['Tony', 'Steve'],
  "last_name": ['Starks', 'Rogers'],
  "email": ['tony@g.com', 'steve@g.com']
}
df3 = pd.DataFrame(people2)
df3

  first_name last_name        email
0       Tony    Starks   tony@g.com
1      Steve    Rogers  steve@g.com

In [ ]:
# use either _append or concat
df._append(df3, ignore_index=True)

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
3   tony@g.com            NaN       Tony    Starks
4  steve@g.com            NaN      Steve    Rogers

In [ ]:
df = pd.concat([df, df3], ignore_index=True)
df # some method might have run twice resulting in duplicate data being inserted as we are using same df variable for dataframe. This will be visible when executing all codes at once vs running this single block of code

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
3   tony@g.com            NaN       Tony    Starks
4  steve@g.com            NaN      Steve    Rogers

In [ ]:
# remove rows using indices
df.drop(index=4)

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
3   tony@g.com            NaN       Tony    Starks

In [ ]:
df

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
3   tony@g.com            NaN       Tony    Starks
4  steve@g.com            NaN      Steve    Rogers

In [ ]:
# to make changes permanent
df.drop(index=4, inplace=True)

In [ ]:
df

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
3   tony@g.com            NaN       Tony    Starks

In [ ]:
# lets say you want to remove the row whose last_name is Doe
# df.drop(index=df[df['last_name'] == 'Doe'].index) 
filt = df['last_name'] == 'Doe' # extracting filter condition for readability
df.drop(index=df[filt].index)

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
3   tony@g.com            NaN       Tony    Starks

In [ ]:
df

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   jane@g.com       Jane Doe       Jane       Doe
2   john@g.com       John Doe       John       Doe
3   tony@g.com            NaN       Tony    Starks

In [ ]:
# again to make persistent
df.drop(index=df[filt].index, inplace=True)
df

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
3   tony@g.com            NaN       Tony    Starks

In [ ]:
df._append({'first_name': 'Aayush'})

TypeError: Can only append a dict if ignore_index=True

In [ ]:
df._append({'first_name': 'Aayush'}, ignore_index=True)

         email      full_name first_name last_name
0  corey@g.com  Corey Schafer      Corey   Schafer
1   tony@g.com            NaN       Tony    Starks
2          NaN            NaN     Aayush       NaN